{
  "architectures": [
    "QuasarLongForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_quasar_long.QuasarLongConfig",
    "AutoModelForCausalLM": "modeling_quasar_long.QuasarLongForCausalLM"
  },
  "dtype": "bfloat16",
  "embedding_dropout": 0.0,
  "engram_dim": 512,
  "engram_layers": [],
  "engram_lr_multiplier": 5.0,
  "engram_ngram_orders": [
    2,
    3
  ],
  "engram_num_heads": 8,
  "engram_residual_scale": 0.01,
  "engram_slots": 2000000,
  "eos_token_id": 156892,
  "first_k_dense_replace": 1,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "hybrid_alpha_init": 0.8473,
  "hybrid_attention_layers": [
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19
  ],
  "hybrid_branch_layout": "layerwise",
  "hybrid_eval_force_branch": "",
  "hybrid_eval_mode": "hybrid_add",
  "hybrid_gla_enabled": true,
  "hybrid_gla_expand_k": 1.0,
  "hybrid_gla_expand_v": 1.0,
  "hybrid_layerwise_cycle": [
    "quasar",
    "raven",
    "quasar",
    "quasar",
    "gla"
  ],
  "hybrid_quasar_enabled": true,
  "hybrid_raven_decay_type": "Mamba2",
  "hybrid_raven_enabled": true,
  "hybrid_raven_slots": 64,
  "hybrid_raven_topk": 32,
  "hybrid_replacement_mode": "add",
  "hybrid_use_short_conv": false,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "long_context_mode": "rope_short_nope_long",
  "max_position_embeddings": 5000000,
  "max_seq_length": 5000000,
  "max_sequence_length": 5000000,
  "max_window_layers": 20,
  "model_type": "quasar_long",
  "moe_intermediate_size": 512,
  "moe_router_enable_expert_bias": true,
  "moe_shared_expert_intermediate_size": 512,
  "mtp_loss_scaling_factor": 0,
  "n_group": 8,
  "nope_after_position": 512,
  "norm_topk_prob": true,
  "num_attention_heads": 16,
  "num_experts": 256,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 20,
  "num_key_value_heads": 4,
  "num_loops": 1,
  "num_nextn_predict_layers": 0,
  "num_shared_experts": 1,
  "output_dropout": 0.0,
  "output_router_logits": false,
  "pad_token_id": 156892,
  "partial_rotary_factor": 0.5,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "partial_rotary_factor": 0.5,
    "rope_theta": 10000,
    "rope_type": "default"
  },
  "rope_scaling": null,
  "rope_theta": 10000,
  "routed_scaling_factor": 2.5,
  "router_dtype": "fp32",
  "score_function": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 4,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.3",
  "use_bias": false,
  "use_cache": true,
  "use_looped_injection": false,
  "use_nope": true,
  "use_qk_norm": true,
  "use_qkv_bias": false,
  "use_rmsnorm": true,
  "vocab_size": 157184,
  "hybrid_gla_mode": "chunk"
}